app/Services/AgendaNotificacionService.php

SELECT `a`.`id`, `a`.`fechaInicio`, `a`.`prioridad`, `c`.`nombre` as `nombre_cliente`, `s`.`servicio` as `servicio_descripcion`, `s`.`estatusServ`
FROM `agenda` `a`
JOIN `cliente` `c` ON `c`.`id` = `a`.`cliente`
JOIN `servicios` `s` ON `s`.`id` = `a`.`servicio`
WHERE DATE(a.fechaInicio) = '2026-07-14'
AND `s`.`estatusServ` NOT IN (3,5)
---
    private function obtenerAgendaDeHoy()
    {
        $db = \Config\Database::connect();

        $hoy = date('Y-m-d');

        return $db->table('agenda a')->select(
        'a.id,
        a.fechaInicio,
        a.prioridad,
        c.nombre as nombre_cliente,
        s.servicio as servicio_descripcion,
        s.estatusServ
        ')->join('cliente c', 'c.id = a.cliente')->join('servicios s', 's.id = a.servicio')
        ->where('DATE(a.fechaInicio)', $hoy)->whereNotIn('s.estatusServ',[3,5])
        ->get()->getResultArray();

SELECT `a`.`id`, `a`.`fechaInicio`, `a`.`prioridad`, `c`.`nombre` as `nombre_cliente`, `s`.`servicio` as `servicio_descripcion`, `s`.`estatusServ`
FROM `agenda` `a`
JOIN `cliente` `c` ON `c`.`id` = `a`.`cliente`
JOIN `servicios` `s` ON `s`.`id` = `a`.`servicio`
WHERE DATE(a.fechaInicio) >= '2026-06-29'
AND DATE(a.fechaInicio) < '2026-07-14'
AND `s`.`estatusServ` NOT IN (3,5)
---
    private function obtenerAgendasAtrasadas()
    {
         $db = \Config\Database::connect();

        $hoy = date('Y-m-d');
        $desde =date('Y-m-d', strtotime('-60 days'));

        return $db->table('agenda a')->select(
        'a.id,
        a.fechaInicio,
        a.prioridad,
        c.nombre as nombre_cliente,
        s.servicio as servicio_descripcion,
        s.estatusServ
        ')->join('cliente c', 'c.id = a.cliente')->join('servicios s', 's.id = a.servicio')
        ->where('DATE(a.fechaInicio) >=', $desde)
        ->where('DATE(a.fechaInicio) <', $hoy)->whereNotIn('s.estatusServ',[3,5])
        ->get()->getResultArray();