app/Services/NotificacionService.php

SELECT *
FROM `notificaciones`
WHERE `leida` = 0
ORDER BY `created_at` DESC
---
    public function paraNavbar()
    {
        $userId = session()->get('user_id');

        //notificaciones guardadas en base de datos
        $persistidas = $this->persistidasNoLeidasBuilder($userId)
            ->orderBy('notificaciones.created_at', 'DESC')
            ->findAll();