app/Services/ServicioAutoNotificacionService.php

    private function obtenerServiciosConAlerta()
    {
        $db = \Config\Database::connect();

        $limite = date('Y-m-d', strtotime('+5 days'));

        return $db->table('servicios_autos sa')->select('sa.id,
        sa.tipo_servicio,
        sa.proximo_servicio,
        sa.tipo_registro,
        a.alias,
        a.placas,
        a.marca,
        a.modelo')->join('autos a', 'a.id = sa.auto_id')->where('sa.proximo_servicio IS NOT NULL', null, false)
        ->where('sa.proximo_servicio<=', $limite)->get()->getResultArray();
---
SELECT `sa`.`id`, `sa`.`tipo_servicio`, `sa`.`proximo_servicio`, `sa`.`tipo_registro`, `a`.`alias`, `a`.`placas`, `a`.`marca`, `a`.`modelo`
FROM `servicios_autos` `sa`
JOIN `autos` `a` ON `a`.`id` = `sa`.`auto_id`
WHERE sa.proximo_servicio IS NOT NULL
AND `sa`.`proximo_servicio` <= '2026-07-19'