app/Controllers/AgendaController.php

    public function getEventos(): object
    {
        // 1. Obtener la lista de agendas
        $eventos = $this->agendaModel
            ->select('agenda.*, cliente.nombre as nombre_cliente, servicios.servicio as descripcion_servicio, servicios.material as serv_material')
            ->join('cliente', 'cliente.id = agenda.cliente')
            ->join('servicios', 'servicios.id = agenda.servicio')
            ->findAll();
        // 2. Obtener todas las asignaciones de técnicos para las agendas
        $asignaciones = $this->ServicioTecnicoModel
            ->select('servicio_tecnicos.*, tecnicos.nombre as nombre_tecnico')
            ->join('tecnicos', 'tecnicos.id = servicio_tecnicos.tecnico_id')
            ->findAll();
---
SELECT `agenda`.*, `cliente`.`nombre` as `nombre_cliente`, `servicios`.`servicio` as `descripcion_servicio`, `servicios`.`material` as `serv_material`
FROM `agenda`
JOIN `cliente` ON `cliente`.`id` = `agenda`.`cliente`
JOIN `servicios` ON `servicios`.`id` = `agenda`.`servicio`
SELECT `servicio_tecnicos`.*, `tecnicos`.`nombre` as `nombre_tecnico`
FROM `servicio_tecnicos`
JOIN `tecnicos` ON `tecnicos`.`id` = `servicio_tecnicos`.`tecnico_id`