app/Controllers/AuthController.php

    public function login()
    {
        $session = session();
        $model = new usuarioModel();

        //$email = $this->request->getPost('email');
        $login = $this->request->getPost('login'); //agregado
        $password = $this->request->getPost('password');
        // Busca el usuario por email
        //$user = $model->where('email', $email)->first();
        //busca por correo o por nombre de usuario
        $user = $model->where('email', $login)
            ->orWhere('nombreUsuario', $login)
            ->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'sistemas'
OR `nombreUsuario` = 'sistemas'
 LIMIT 1