app/Controllers/ClienteController.php

    public function listarClientes(): string
    {
        $data['clientes'] = $this->clienteModel->findAll();
---
SELECT *
FROM `cliente`