app/Controllers/InventarioController.php

SELECT *
FROM `inventario`
ORDER BY `activo` DESC, `nombre` ASC
---
    public function index()
    {
        $inventario = $this->inventarioModel
            ->orderBy('activo', 'DESC')
            ->orderBy('nombre', 'ASC')
            ->findAll();