app/Controllers/ServicioController.php

SELECT *
FROM `servicios`
WHERE `servicios`.`id` = 346
SELECT *
FROM `cliente`
SELECT *
FROM `estatusservicio`
---
    public function editServicio(int $id): string | RedirectResponse
    {
        $servicio = $this->servicioModel->find($id);

        if ($servicio) {
            $data = [
                'clientes' => $this->clienteModel->findAll(),
                'estatusservicio' => $this->estatusServicioModel->findAll(),
                'servicio' => $servicio,
                //AGREGAR: información de estatus para la condición
                'estatus_actual' => $servicio['estatusServ'] // Este es el ID del estatus
            ];