app/Controllers/ServicioAutoController.php

SELECT *
FROM `autos`
WHERE `activo` = 1
SELECT `servicios_autos`.*, `autos`.`alias`, `autos`.`placas`, `autos`.`marca`, `autos`.`modelo`
FROM `servicios_autos`
JOIN `autos` ON `autos`.`id` = `servicios_autos`.`auto_id`
---
    public function index()
    {
        $data ['autos'] = $this->autoModel->where('activo', 1)->findAll();
        $data ['servicios'] = $this->servicioModel->select(
            'servicios_autos.*,
            autos.alias,
            autos.placas,
            autos.marca,
            autos.modelo'
        )
        ->join('autos', 'autos.id = servicios_autos.auto_id')
        ->findAll();

SELECT *
FROM `autos`
WHERE `autos`.`id` = '20'
---
    public function detalles ($id)
    {
        $servicio = $this->servicioModel->find($id);
        if(!$servicio){
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        $auto = $this->autoModel->find($servicio['auto_id']);

SELECT *
FROM `autos`
WHERE `autos`.`id` = '20'
---
    private function validarDatosServicio($tipoRegistro, $id = null)
    {
        if (!in_array($tipoRegistro, $this->tiposRegistroPermitidos, true)) {
            return redirect()->back()->with('error', 'Seleccione un tipo de registro válido.')->withInput();
        }

        $autoId = $this->request->getPost('auto_id');
        if ($autoId !== null && $autoId !== '' && !$this->autoModel->find($autoId)) {
            return redirect()->back()->with('error', 'Seleccione un auto válido.')->withInput();
        }

        if ($id === null && (empty($autoId) || !$this->autoModel->find($autoId))) {